<template>
    <v-container>
        <v-row
            justify="center"
        >
            <v-col
                cols="12"
                sm="12"
                md="10"
                lg="8"
            >
                <v-card flat>
                    <v-card-title>Тренування</v-card-title>
                    <v-card-text>
                        Якщо ви робите свої перші кроки на шляху до ідеального тіла – вам необхідна грамотно розроблена індивідуальна система тренувань. Тільки такий підхід до занять принесе максимальний результат за мінімальний термін. Наш сервіс спрямований на автоматизацію побудови тренувань тих, хто прагне до красивої, рельєфної фігури і здоров'я.
                    </v-card-text>
                    <v-card-title>Конструктор тренувань</v-card-title>
                    <v-card-text>
                        У нас є готові рішення для будь-якого спортсмена, незалежно від того, яку мету він ставить перед собою. Буквально за пару кліків ви підберете для себе відповідну програму тренувань.
                    </v-card-text>
                    <v-card-text>
                        Ви хочете набрати масу або зацікавлені в красивому рельєфі? Залежно від того, який очікується результат, за допомогою конструктора ви зможете скласти список тренувань, наповнити їх вправами, вказати такі параметри, як підходи, повтори та вага снаряда необхідна для виконання вправ.
                    </v-card-text>
                    <v-card-text>
                        Для того щоб почати побудову тренувань, необхідно авторизуватись, перейти у розділ «мої тренування» і увімкнути режим побудови. Зробити це можна, натиснувши на кнопку <v-icon small>mdi-cogs</v-icon> біля назви тренування.
                    </v-card-text>
                    <v-card-text>
                        У випадку якщо список тренувань порожній користувач може додати тренування із запропонованого каталогу в розділі «тренування» натиснувши клавішу <v-icon small>mdi-plus</v-icon>.
                    </v-card-text>
                    <v-stepper
                        v-model="step"
                        vertical
                        non-linear
                        flat
                    >
                        <v-stepper-step
                            editable
                            step="1"
                        >
                            Створення тренувань
                            <small>Введення основних даних</small>
                        </v-stepper-step>

                        <v-stepper-content step="1">
                            <v-card>
                                <v-card-text>
                                    Після натискання кнопки «Створити +», відкриється форма додавання тренувань.
                                </v-card-text>
                                <v-img src="/images/create_workout.png" height="300" contain></v-img>
                                <v-card-text class="pb-0">
                                    У формі потрібно заповнити наступні поля:
                                    <ul>
                                        <li>
                                            <v-card-text>
                                                В поле «Назва» вказується будь-яке зручне для вас найменування тренування. Ця назва буде відображатися в списку тренувань, вона повинна бути обов'язково вказана.
                                            </v-card-text>
                                        </li>
                                        <li>
                                            <v-card-text>
                                                В поле «Стиль» задається стиль виконання тренування. Потрібно вибрати один з варіантів.
                                            </v-card-text>
                                        </li>
                                        <li>
                                            <v-card-text>
                                                У таблиці «Групи вправ» обов'язково повинна бути вказана хоча б одна група. Кожне тренування може складатися з однієї або декількох груп вправ. Вправи в тренуванні можуть групуватися за різними ознаками. Наприклад, це можуть бути дні тренувань (перший день, другий день, третій день), дні тижня (понеділок, середа, п'ятниця) або групи м'язів (руки, спина, груди).
                                            </v-card-text>
                                        </li>
                                    </ul>
                                </v-card-text>
                                <v-card-text class="pt-0">
                                    При необхідності відредагувати введені дані можна натиснувши клавішу <v-icon small>mdi-pencil</v-icon> у списку тренувань або в режимі модифікації вибраного заняття.
                                </v-card-text>
                            </v-card>
                        </v-stepper-content>

                        <v-stepper-step
                            step="2"
                            editable
                        >
                            Додавання тренувань
                            <small>Введення кількість повторень, підходів та ваги</small>
                        </v-stepper-step>

                        <v-stepper-content step="2">
                            <v-card>
                                <v-card-text>
                                    Додані вправи будуть потрапляти в поточну групу вправ. Поточну групу виділено відповідним кольором.
                                </v-card-text>
                                <v-card-text>
                                    Для додавання вправи досить натиснути кнопку «Створити +», яка знаходиться під групами вправ і доступна в режимі модифікації тренування. Після цього відкриється форма додавання вправи.
                                </v-card-text>
                                <v-img src="/images/create_exercise.png" height="300" contain></v-img>
                                <v-card-text class="pb-0">
                                    У формі потрібно заповнити наступні поля:
                                    <ul>
                                        <li>
                                            <v-card-text>
                                                Поле «Вправа». В даному полі вибирається вправf з каталогу вправ. Значення потрібно вибрати зі списку. Почніть забивати назвe вправи і список заповниться доступними вправами. Дане поле є обов'язковим для заповнення.
                                            </v-card-text>
                                        </li>
                                        <li>
                                            <v-card-text>
                                                Параметри виконання вправи заповнюються в полях: «Підходи», «Повтори», «Вага». Дані поля є обов'язковими для заповнення.
                                            </v-card-text>
                                        </li>
                                    </ul>
                                </v-card-text>
                                <v-card-text class="pt-0">
                                    Після того як форма буде заповнена, натискайте кнопку «Створити» і нова вправа буде додана до списку вправ поточної групи вправ.
                                </v-card-text>
                            </v-card>
                        </v-stepper-content>

                        <v-stepper-step
                            step="3"
                            editable
                        >
                            Режим модифікації вправ
                            <small>Редагування, переміщення, видалення вправи</small>
                        </v-stepper-step>

                        <v-stepper-content step="3">
                            <v-card>
                                <v-card-text>
                                    Для переміщення, зміни або видалення вправи потрібно скористатися відповідними кнопками, розташованими в нижній області картки вправи.
                                </v-card-text>
                                <v-img src="/images/panel.png" height="50" contain></v-img>
                                <v-card-text>
                                    Кнопка «Переміщення» служить для переміщення вправи догори, вниз в списку вправ. Для переміщення вправи потрібно натиснути на кнопку і, не відпускаючи її, перемістити вправу в потрібну сторону.
                                </v-card-text>
                                <v-card-text>
                                    При натисканні на кнопку «Редагувати», відкриється форма редагування вправи. Дана форма аналогічна формі додавання вправи і заповнюється за таким же принципом. Після зміни даних вправи необхідно натиснути кнопку «Редагувати».
                                </v-card-text>
                                <v-card-text>
                                    Кнопка «Видалити» служить для видалення вправи зі списку. Перед видаленням потрібно підтвердити видалення, натиснувши кнопку «Так» у вікні.
                                </v-card-text>
                            </v-card>
                        </v-stepper-content>
                    </v-stepper>
                    <v-card-text>
                        Тепер у вас не буде приводу пропустити заняття в тренажерному залі! Чітка, структурована і зручна у використанні програма, допоможе дотримуватися графіка тренувань, а також контролювати динаміку ваги і росту м'язів.
                    </v-card-text>
                </v-card>
            </v-col>
        </v-row>
    </v-container>
</template>

<script>
export default {
    name: "home",
    props: ['loadingPage'],

    data() {
        return {
            step: 1,
        };
    },

    created() {
        this.$emit('update:loadingPage', false);
        this.$Progress.finish();
    },
}
</script>

<style scoped>

</style>
